[{"_id":"4ee31d7cda5fba0001000009","abstract":"TBD","from":"2011-12-17T11:00:00+00:00","from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"11","from(5i)":"45","proposal_id":"4ea68399504f360001000048","room":"Sala Verde","speaker":{"_id":"4ee31d7cda5fba000100000a","bio":"Developer Evangelist, Windows 8 e Windows Phone Champ, membro delle community dai primi anni 2000","blog":"http://www.geniodelmale.info","email":"lorenzo.barbieri@microsoft.com","name":"Lorenzo Barbieri","twitter":"_geniodelmale"},"title":"WinRT e il futuro dello sviluppo per Windows","to":"2011-12-17T12:45:00+00:00","to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"12","to(5i)":"45"},{"_id":"4ee31e42da5fba0001000019","abstract":"Fino a prima dell'avvento di Roslyn, il compilatore era una black box alla quale guardavamo con sconsolata ammirazione. Ora le \"porte\" si aprono e le possibilità si sprecano. \r\nIn questa sessione cercheremo di capire di che si tratta e come sfruttare le potenzialità del compiler-as-a-service","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"14","from(5i)":"15","proposal_id":"4ea73d2fb0f3510001000008","room":"Sala Gialla","speaker":{"_id":"4ee31e42da5fba000100001a","bio":"Alessandro si appassiona al mondo dello sviluppo software fin dai primi anni di università, e dopo il conseguimento della laurea in Ingegneria Elettronica, la sua passione diventa il suo lavoro. Dopo i primi anni di sviluppo in C++, Alessandro sposta le sue attenzioni verso C# e a tutto ciò che gravita attorno alla piattaforma .NET.\r\n\r\nAd oggi, Alessandro è un consulente e trainer specializzato nello sviluppo di applicazioni con tecnologia Microsoft e negli ultimi anni è diventato un “adepto” delle metodologie agili che usa quotidianamente nei progetti che lo coinvolgono.","blog":"http://blog.codiceplastico.com/melkio","email":"alessandro@codiceplastico.com","name":"Alessandro Melchiori","twitter":"amelchiori"},"title":"Roslyn: un compilatore per amico","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"15","to(5i)":"15"},{"_id":"4eecf6f1ad848c000100000d","abstract":"","from":"2011-12-17T11:45:00+00:00","proposal_id":null,"room":"Sala Gialla","speaker":{"_id":"4eecf6f1ad848c000100000e","bio":"-","blog":"-","email":"-","name":"-","twitter":""},"title":"","to":"2011-12-17T12:45:00+00:00"},{"_id":"4ee39b81bbb0410001000001","abstract":"Come usare (o non usare) threading, replication, operazioni asincrone e tecniche affini in un sistema in cui sono importanti sia la bassa latenza che il throughput complessivo.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"17","from(5i)":"00","proposal_id":"4ea53a9eecf6180001000069","room":"Sala Magenta","speaker":{"_id":"4ee39b81bbb0410001000002","bio":"Ho lavorato nel team di Mono sul JIT compiler e sul runtime in generale.\r\nPoi mi sono dedicato a portare Mono su XBox360, PS3 ed altre console.\r\nOra sto lavorando ad una piattaforma per\r\nfornire fiere virtuali online (www.hyperfair.com), la sessione e' il risultato di questa esperienza.","blog":"","email":"massimiliano.mantione@gmail.com","name":"Massimiliano Mantione","twitter":"M_a_s_s_i"},"title":"Come implementare un server per giochi on line in real time","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"18","to(5i)":"00"},{"_id":"4ee31d27da5fba0001000003","abstract":"A volte DDD sembra \"troppo bello per essere vero\". E se invece volessimo fare DDD in un mondo dominato da query, stored procedures, codice legacy, data-based integration ed altre amenità simili?","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"10","from(5i)":"30","proposal_id":"4eb69cf0f8c3080001000009","room":"Sala Blu","speaker":{"_id":"4ee31d27da5fba0001000004","bio":"Alberto Brandolini è un professionista dell'information technology con il pallino di vedere tutto da un'angolazione diversa e di cercare di risolvere il prossimo problema.\r\nConsulente, docente, speaker, imprenditore, blogger, autore, in Italia ed all'estero, in determinate circostanze riesce anche a sembrare una persona seria.","blog":"http://ziobrando.blogspot.com/","email":"alberto.brandolini@gmail.com","name":"Alberto Brandolini","twitter":"ziobrando"},"title":"DDD Brutto Sporco e Cattivo","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"11","to(5i)":"30"},{"_id":"4ee31d38da5fba0001000005","abstract":"Managing software dependencies, whether those created in-house or from third parties can be a pain in the behind. Whether dependencies feel like wild chickens or people run around like chickens dealing with dependencies, the NuGet package manager can be a cure. Let us guide you to creating enterprise (chicken) NuGets and dealing with them in a structured, easy-to-maintain manner. From developer workstation to build server, NuGet tastes great! We'll provide you the dip sauce.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"14","from(5i)":"15","proposal_id":"4eb50aaa3e9c370001000041","room":"Sala Blu","speaker":{"_id":"4ee31d38da5fba0001000006","bio":"http://about.me/xavierdecoster","blog":"http://www.xavierdecoster.com","email":"xavier.decoster@realdolmen.com","name":"Xavier Decoster","twitter":"xavierdecoster"},"title":"Organize your chickens: NuGet for the enterprise","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"15","to(5i)":"15"},{"_id":"4ee31d52da5fba0001000007","abstract":"Almost all HTML5 and web applications today make use of AJAX to communicate between client and server. AJAX is great with asynchronous operations, but what about real-time communication? How would you push a message from server to client? HTML5 websockets offer a solution to all of these questions but are not supported in every browser and every network environment. SignalR is the new cool kid on the block: it leverages websockets when supported and falls back to different mechanisms when they aren’t. In this session, I’ll show you where and how to use SignalR to create rich real-time applications in the browser. No toothpaste. Just code.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"15","from(5i)":"45","proposal_id":"4eb508e33e9c37000100003d","room":"Sala Blu","speaker":{"_id":"4ee31d52da5fba0001000008","bio":"Maarten Balliauw is a technical consultant in web technologies at RealDolmen, one of Belgium's biggest ICT companies. His interests are ASP.NET (MVC), PHP and Windows Azure. He's a Microsoft Most Valuable Professional (MVP) for Windows Azure and has published many articles in both PHP and .NET literature such as MSDN magazine and PHP architect. Maarten is a frequent speaker at various national and international events such as MIX (Las Vegas), TechDays, DPC, ... His blog can be found at http://blog.maartenballiauw.be.","blog":"http://blog.maartenballiauw.be","email":"maarten@balliauw.be","name":"Maarten Balliauw","twitter":"maartenballiauw"},"title":"SignalR. Code, not toothpaste. Using SignalR for realtime client/server communication","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"16","to(5i)":"45"},{"_id":"4ee31d94da5fba000100000b","abstract":"Il protocollo Open Data Protocol è nato con l'intento di essere il nuovo \"ODBC\" e permettere di erogare dati in modo standard e facilmente fruibile.\r\nGià oggi aziende come Netflix, Twitpic ed eBay stanno erogando dati sul web con questo protocollo, cosa che ci tranquillizza sulla solidità delle sue specifiche e delle attuale implementazioni.\r\nLa vera domanda è se può essere lecito farlo diventare il futuro dei datalayer nelle nostre applicazioni.\r\nDopo una panoramica di come funziona e quali siano le tecnologie per produrre e consumare questi 'feed' di dati, apriremo le discussioni su questa opportunità architetturale.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"17","from(5i)":"00","proposal_id":"4eaa75bd2d01590001000022","room":"Sala Blu","speaker":{"_id":"4ee31d94da5fba000100000c","bio":"https://mvp.support.microsoft.com/profile/raffaele","blog":"http://blogs.ugidotnet.org/raffaele","email":"raffaeler@vevy.com","name":"Raffaele Rialdi","twitter":"raffaeler"},"title":"oData può rappresentare il futuro del DataLayer?","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"18","to(5i)":"00"},{"_id":"4ee31db0da5fba000100000d","abstract":"Vantaggi, problemi e soluzioni nell'uso di un database documentale, come RavenDB, in un'applicazione distribuita.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"17","from(5i)":"00","proposal_id":"4ec6616080ede9000100001d","room":"Sala Verde","speaker":{"_id":"4ee31db0da5fba000100000e","bio":"Si occupa di sviluppo di applicazioni enterprise, segue le evoluzioni del framework.NET sin dalla Beta 1 della versione 1.0. Con l’uscita ufficiale di Visual Studio 2002 si è buttato a capofitto nel mondo .net inizialmente sviluppando applicazioni web per poi migrare pian piano verso windows forms e per giungere infine allo sviluppo di servizi e soluzioni enterprise. ","blog":"http://milestone.topics.it","email":"mauro@topics.it","name":"Mauro Servienti","twitter":""},"title":"Using RavenDB in the wild","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"18","to(5i)":"00"},{"_id":"4ee4e05fe1fc9b0001000001","abstract":"L'idea del talk è quella di prendere spunto da alcune osservazioni recenti, su come spesso in fase di preventivazione di un lavoro si tenda a sottovalutare tutta una serie di aspetti e attività apparentemente secondari, ma in realtà con un impatto notevole sull'effort, sul tempo complessivo che sarà necessario dedicare a quell'attività per completare il lavoro richiesto.\r\n\r\nA partire da queste \"osservazioni sul campo\" proverò a suggerire alcuni accorgimenti che ho adottato nella mia esperienza per evitare questo \"effetto sottovalutazione\", coinvolgendo la platea e invitando i partecipanti a discutere e confrontarsi con me su questi e su altri stratagemmi che ho intenzione di provare nel futuro.\r\n\r\nScopo del talk è quello di portare all'attenzione degli sviluppatori (ma non solo loro) come questo \"difetto\" nelle proprie stime abbia impatto non solo sulla remuneratività del proprio lavoro e sul tempo che dedichiamo ad esso, ma soprattutto sulla qualità complessiva del prodotto consegnato al cliente.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"11","from(5i)":"45","proposal_id":"4ea5c199ecf61800010000be","room":"Sala Blu","speaker":{"_id":"4ee4e05fe1fc9b0001000002","bio":"Mi occupo di web e interaction design da oltre dieci anni, durante i quali ho potuto dedicarmi sia a progetti di medie-grandi dimensioni che di piccoli progetti di comunicazione. Sono nato come web-developer, ma ben presto ho cominciato ad allargare le mie competenze anche alla parte di design. Da qui all’interaction design il passo è stato breve.\r\nOggi mi occupo e appassiono di user-experience, di architettura delle informazioni, di marketing della comunicazione, di metodologie agili. Per questo motivo cerco - ogni qual volta mi è possibile - di condividere questa mia passione, partecipando ad incontri e conferenze specializzate (sia da relatore che da spettatore), portando la mia esperienza e offrendo alla discussione pensieri, riflessioni e spunti che quotidianamente incontro nel mio lavoro.","blog":"http://www.didoo.net","email":"info@didoo.net","name":"Cristiano Rastelli","twitter":"@areaweb"},"title":"Perché a fare i preventivi facciamo così schifo?","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"12","to(5i)":"45"},{"_id":"4ee31df8da5fba0001000013","abstract":"In un mercato che non designa vincitori assoluti nella diffusione di un particolare dispositivo mobile, poter sviluppare applicazioni che tengano conto dei maggiori device in commercio può essere il valore aggiunto che possiamo dare al nostro business. In questa sessione vedremo come sfruttare Asp.Net MVC, HTML5, CSS3 e jQuery Mobile per realizzare applicazioni web che tengano conto del dispositivo su cui sono utilizzate.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"10","from(5i)":"30","proposal_id":"4ecfb8c6e531750001000011","room":"Sala Gialla","speaker":{"_id":"4ee31df8da5fba0001000014","bio":"Michele Aponte è cofondatore e presidente della community DotNetCampania (www.dotnetcampania.org), con la quale organizza eventi tecnici inerenti le tecnologie Microsoft sul territorio campano. Attualmente è responsabile formazione, area sviluppo e risorse umane di BC Soft Srl; collabora con Overnet Education come teacher per i corsi di sviluppo e con Html.it come autore di articoli. E' Microsoft Certified Professional, Microsoft Certified Tecnology Specialist, Microsoft Certified Professional Developer e Microsoft Certified Trainer. Dal 1 Gennaio 2011 è stato nominato Microsoft MVP nella categoria Asp.Net/IIS. Il suo blog: http://dotnetcampania.org/blogs/michele ","blog":"http://dotnetcampania.org/blogs/michele","email":"michele.aponte@dotnetcampania.org","name":"Michele Aponte","twitter":"apomic80"},"title":"Sviluppare applicazioni web mobile con Asp.Net MVC, HTML5 e jQuery Mobile","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"11","to(5i)":"30"},{"_id":"4ee31e71da5fba000100001d","abstract":"WebGL is a technology that allows you to write 3D accelerated software in JavaScript, all in the browser - with some awesome shininess.\r\n\r\nNode.js is a technology that allows you to write server-side JavaScript in a largely asynchronous and non-blocking manner.\r\n\r\nWebsockets allow you to communicate between the browser and external servers in an efficient and lightweight manner.\r\n\r\nMarrying these three technologies gives us some amazing possibilities, and in this session we'll explore what each of these things are and showcase some examples (and code) for using them together.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"11","from(5i)":"45","proposal_id":"4ec6768880ede90001000023","room":"Sala Magenta","speaker":{"_id":"4ee31e71da5fba000100001e","bio":"A software developer living in Belgium, occasionally leaving to talk shop.","blog":"http://codeofrob.com","email":"robashton@codeofrob.com","name":"Rob Ashton","twitter":"robashton"},"title":"Building awesome games with WebGL and Node.js","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"12","to(5i)":"45"},{"_id":"4ee3247eda5fba0001000028","abstract":"In questa sessione vedremo un esperimento di user experience \"ambientale\" realizzata con arduino, processing e qualche sensore.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"10","from(5i)":"30","proposal_id":"4eaae1c44e4f89000100000a","room":"Sala Magenta","speaker":{"_id":"4ee3247eda5fba0001000029","bio":"Daniela Panfili è una user experience designer con 10 anni esperienza nella progettazione di interfacce ed esperienze d'uso su svariati media e device: video, interactive walls, web, RIA e applicazioni per mobile e tablet. Ultimamente si sta anche interessando di pervasive computing.","blog":"http://tsoda.eu","email":"daniela@piyosailing.com","name":"Daniela Panfili","twitter":"tsoda"},"title":"Oltre lo schermo: la user experience delle \"cose\"","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"11","to(5i)":"30"},{"_id":"4ee4e189e1fc9b0001000003","abstract":"Adottare Test Driven Development ovunque, dallo scrivere il gioco “BomberMan” ad un motion detector.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"10","from(5i)":"30","proposal_id":"4ea8c19d14fe030001000099","room":"Sala Verde","speaker":{"_id":"4ee4e189e1fc9b0001000004","bio":"Matteo Migliore è software architect e senior developer, da 12 anni lavora su tecnologia .NET.\r\nSpecializzato in visione artificiale e applicazioni web, ORM e mentore su agile, Scrum ed tecniche XP (Extreme Programming).\r\nSi occupa inoltre di formazione su Test Driven Development (TDD), layering, tecniche di refactoring e miglioramento della comunicazione\r\ne risoluzione dei conflitti nei team.","blog":"http://blogs.ugidotnet.org/matteomigliore","email":"matteo.migliore@gmail.com","name":"Matteo Migliore","twitter":"matteomigliore"},"title":"TDD everywhere","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"11","to(5i)":"30"},{"_id":"4ee31e0cda5fba0001000015","abstract":"We all know git. We use it. It works. We see it everywhere every day more: github is a powerful tool, backing open source development like never before. But there’s more under the hood.  Git made my work better and much more enjoyable. I would love to give back to the community what I learned.\r\nIn this talk I will present how this amazing tool can be adapted to your own personalized workflow, whether you are an independent developer or a large company. I will present th most useful and relevant parts to know about git’s internals as well as all the tricks I find to be really time-savers. I will show u good practices in git’s daily use such as good branching models, how git can be an excellent assistant when debugging, and more.\r\nThis is not the usual talk on git’s basics. But it does not require too much background knowledge either. ","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"14","from(5i)":"15","proposal_id":"4ea87f2714fe03000100004f","room":"Sala Verde","speaker":{"_id":"4ee31e0cda5fba0001000016","bio":"Alessandro Cinelli (a.k.a. cirpo) is a PHP developer with Java and Javascript skills. After a life spent trying to convince passers-by to buy his spiteful employers Sicilian almond cakes he got bored of people and decided that the web 2.0 was more fun. So he bought a computer, installed Gentoo GNU/Linux and started hacking. Years later he saw the light, acquired a Mac, and stopped compiling kernels. Now he works in Ideato, an Agile Php company, and lives in Cesena. His social life hasn t recovered yet.\r\nHe is also the founder of a local group of passionate web developers with a wide range of backgrounds and skills called WEBdeBS and part of the GRUSP board directors, the Italian Php user group.","blog":"","email":"alessandro.cinelli@gmail.com","name":"alessandro cinelli","twitter":"cirpo"},"title":"Git Happens!","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"15","to(5i)":"15"},{"_id":"4ee31e2bda5fba0001000017","abstract":"CQRS, ovvero: 2 stack, uno per \"leggere\" e l'altro per \"scrivere\". Se per \"scrivere\" abbiamo l'imbarazzo della scelta (Domain Model, Commans, Event Sourcing, ...) per leggere, invece, apparentemente c'è poco da dire. \"Apparentemente\", appunto. Parliamone :-)","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"15","from(5i)":"45","proposal_id":"4ebbf70b8608050001000009","room":"Sala Gialla","speaker":{"_id":"4ee31e2bda5fba0001000018","bio":"Andrea Saltarello è direttore tecnico di Managed Designs (http://www.manageddesigns.it), azienda di consulenza IT e legale, per la quale ricopre anche le mansioni di software architect. E' autore di articoli tecnici per differenti testate editoriali (tra le quali la prestigiosa MSDN Magazine) e co-autore di \"Microsoft .NET: Architecting Applications for the Enterprise\", pubblicato da Microsoft Press, nonché relatore presso eventi e conferenze quali: WPC, Microsoft DevDays/Roadshow, TechEd Europe. Fondatore e leader di UGIdotNET (User Group Italiano .NET) e GUISA (Gruppo Utenti Italiani Solution Architect), è appassionato di musica indie rock e dark/new wave; blatera di questo argomento e di \"quisquilie IT\" sul proprio blog e Twitter.","blog":"http://blogs.ugidotnet.org/pape","email":"andysal@gmail.com","name":"Andrea Saltarello","twitter":"andysal74"},"title":"Layered Expression Trees feat. CQRS","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"16","to(5i)":"45"},{"_id":"4ee31e88da5fba000100001f","abstract":"Spesso un click da parte di un utente, o la chiamata ad un servizio, può provocare nel nostro codice operazioni che richiedono un tempo di esecuzione decisamente lungo. Questo porterebbe l'utilizzatore del client (che sia un proxy o un utente) ad attese non accettabili. Per ovviare a questo problema una possibile soluzione può essere l'uso della programmazione asincrona. In questa sessione vedremo come implementarla attraverso l'uso del Framework Async che sarà presente nella prossima versione del .NET Framework.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"14","from(5i)":"15","proposal_id":"4ed17605c286450001000009","room":"Sala Magenta","speaker":{"_id":"4ee31e88da5fba0001000020","bio":"TBD","blog":"http://dotnetcampania.org/turibbio","email":"antonio.liccardi@dotnetcampania.org","name":"Antonio Liccardi, Emanuele Garofalo","twitter":"turibbio"},"title":"I Love Async!","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"15","to(5i)":"15"},{"_id":"4ee31ebdda5fba0001000021","abstract":"Se si chiama Object Oriented Programming perché tutti parlano di classi? Il codice che scriviamo è realmente ad oggetti? Cosa significa scrivere codice ad oggetti? Cosa ci dà (ci dovrebbe dare???) in più questa tecnologia rispetto alle altre? In questa sessione si cerca di analizzare cosa si intende per codice ad oggetti e come spesso si ponga l'attenzione su cose secondarie o addirittura errate. Con un poco di teoria e di pratica si può correggere questa deriva?","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"17","from(5i)":"00","proposal_id":"4eca15897ea529000100000d","room":"Sala Gialla","speaker":{"_id":"4ee31ebdda5fba0001000022","bio":"Gianluca ha oltre 15 anni di esperienza nel campo dello sviluppo e del design del software in molti contesti diversi (Web, enterprise, sistemi embedded). Si interessa del movimento agile (XP) dal 2004 e dal 2005 è coach XP di un team composto da più di 15 persone. Ha una profonda conoscenza dei linguaggi di programmazione C#/C++/Java e recentemente ha iniziato a dedicarsi a linguaggi dinamici come Javascript e Ruby.\r\n","blog":"","email":"GPadovani@gmail.com","name":"Gianluca Padovani","twitter":"gpad619"},"title":"OOP vs COP - Classi contro oggetti","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"18","to(5i)":"00"},{"_id":"4ee4e1c0e1fc9b0001000005","abstract":"Il mondo dei linguaggi di programmazione è dominato da due filosofie\r\ndiverse: quella dei linguaggi \"statici\", come C# e Java, e quella dei\r\nlinguaggi \"dinamici\", come Ruby e Python. Un bravo sviluppatore\r\ndovrebbe sapersi muovere senza difficoltà da un mondo all'altro, ma la\r\ncosa sembra più difficile di quello che potremmo pensare. In questo\r\ntalk parlerò degli ostacoli che dobbiamo superare per diventare\r\nmadrelingua in un linguaggio statico e uno dinamico allo stesso tempo,\r\nprendendo a prestito qualche idea dalla psicologia cognitiva. In\r\nparticolare mostrerò come gli stessi principi di design e architettura\r\nportano ad un sistema software completamente diverso a seconda del\r\nlinguaggio con il quale lavoriamo.","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"15","from(5i)":"45","proposal_id":"4ead32416fe2ef000100000a","room":"Sala Magenta","speaker":{"_id":"4ee4e1c0e1fc9b0001000006","bio":"Paolo Perrotta lavora da quattordici anni come sviluppatore di\r\nsoftware freelance, autore di libri e articoli e coach di team agili.\r\nHa lavorato per molte aziende e in molti campi diversi, dal software\r\nembedded per l'industria automobilistica ai videogiochi e alle\r\napplicazioni web. Dopo anni di Java e C# ha scritto il libro\r\n\"Metaprogramming Ruby\" per i Pragmatic Programmers, considerato uno\r\ndei libri fondamentali per chi usa questo linguaggio.","blog":"http://ducktypo.blogspot.com","email":"paolo.nusco.perrotta@gmail.com","name":"Paolo Perrotta","twitter":"nusco"},"title":"Java Viene da Marte, Ruby da Venere ","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"16","to(5i)":"45"},{"_id":"4ee4e1d3e1fc9b0001000007","abstract":"Javascript è stato per anni un linguaggio molto sottovalutato, l'evoluzione delle tecnologie web, però lo stanno fortemente rivalutando elevandolo al rango che gli compete. In questa sessione sarà presentata una possibile soluzione web HTML5 basata su ASP.NET MVC 3.0 in cui il front-end utilizza KnockoutJs (un framework Model-View-ViewModel Javascript), jQuery, servizi REST WCF e supporto alla modularità mediante MEF (Microsoft Extensibility Framework)","from":null,"from(1i)":"2011","from(2i)":"12","from(3i)":"17","from(4i)":"15","from(5i)":"45","proposal_id":"4eb4f5a03e9c370001000003","room":"Sala Verde","speaker":{"_id":"4ee4e1d3e1fc9b0001000008","bio":"Ingegnere ed architetto software, Roberto ha come interesse professionale primario quello dei GIS (Sistemi Informativi Geografici), esperto della tecnologia ESRI e dei più importanti prodotti open source, soprattutto in ambito geomarketing. Come consulente ha maturato solide esperienze su tematiche enterprise data-centriche relative allo stack tecnologico Microsoft .NET, in particolare Entity Framework, WCF, Silverlight e ASP.NET MVC. Si dedica da qualche tempo anche all'intero ciclo di vita della realizzazione di una soluzione IT, cercando di trovare il miglior connubio fra requisiti ed implementazione.","blog":"http://blogs.ugidotnet.org/robymes","email":"roberto@messora.com","name":"Roberto Messora","twitter":"robymes"},"title":"ASP.NET MVC, Javascript MVVM e WCF REST Services: web to the max","to":null,"to(1i)":"2011","to(2i)":"12","to(3i)":"17","to(4i)":"16","to(5i)":"45"}]